spec/data/swissindex_nonpharma.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope
  xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <soap:Body>
    <NONPHARMA
      CREATION_DATETIME="2012-10-18T06:31:19.4687619+02:00"
      xmlns="http://example.com/test">
        <ITEM DT="2013-06-22T00:00:00">
          <GTIN>733905577161</GTIN>
          <PHAR>5366964</PHAR>
          <STATUS>A</STATUS>
          <STDATE>2012-08-22T00:00:00</STDATE>
          <LANG>FR</LANG>
          <DSCR>1-DAY ACUVUE moist jour -2.00dpt BC 8.5</DSCR>
          <ADDSCR>30 pce</ADDSCR>
          <COMP>
            <NAME>Johnson &amp; Johnson Consumer (Health Care / OTC)</NAME>
          </COMP>
        </ITEM>
        <ITEM DT="2012-10-18T00:00:00">
        <GTIN>0000000000000</GTIN>
        <PHAR>00000</PHAR>
        <STATUS>A</STATUS>
        <STDATE>2002-05-23T00:00:00</STDATE>
        <LANG>DE</LANG>
        <DSCR>Foo 1000 mg</DSCR>
        <ADDSCR>Amp</ADDSCR>
        <COMP>
          <NAME>EXAMPLE.COM AG</NAME>
          <GLN>0000000000000</GLN>
        </COMP>
      </ITEM>
      <ITEM DT="2012-10-18T00:00:00">
        <GTIN>0000000000001</GTIN>
        <PHAR>00001</PHAR>
        <STATUS>A</STATUS>
        <STDATE>2002-05-23T00:00:00</STDATE>
        <LANG>DE</LANG>
        <DSCR>Bar 10 Stk</DSCR>
        <ADDSCR>10 Stk</ADDSCR>
        <COMP>
          <NAME>EXAMPLE.ORG AG</NAME>
        </COMP>
      </ITEM>
      <ITEM DT="2012-10-18T00:00:00">
        <GTIN>0000000000002</GTIN>
        <PHAR>00002</PHAR>
        <STATUS>A</STATUS>
        <STDATE>2002-05-23T00:00:00</STDATE>
        <LANG>DE</LANG>
        <DSCR>Baz 10 Tablet</DSCR>
        <ADDSCR>5 Stk</ADDSCR>
        <COMP>
          <NAME>EXAMPLE.AC AG</NAME>
        </COMP>
      </ITEM>
      <RESULT>
        <OK_ERROR>OK</OK_ERROR>
        <NBR_RECORD>3</NBR_RECORD>
      </RESULT>
    </NONPHARMA>
  </soap:Body>
</soap:Envelope>
